INSERT INTO occupation (id, description)
VALUES (1, 'Музыкант'),
       (2, 'Композитор'),
       (3, 'Текстовик'),
       (4, 'Певец'),
       (5, 'Аранжировщик');

INSERT INTO author (id, name, occupation_id)
VALUES (1, 'Иван Иванов', 1),
       (2, 'Петр Петров', 2),
       (3, 'Светлана Смирнова', 3),
       (4, 'Елена Петрова', 4),
       (5, 'Олег Олев', 5);

INSERT INTO song (id, name, author_id, release_date)
VALUES (1, 'Весенний дождь', 1, '2023-04-01'),
       (2, 'Музыка света', 2, '2023-05-15'),
       (3, 'Тень мечты', 3, '2023-06-20'),
       (4, 'Шепот волн', 4, '2023-07-30'),
       (5, 'Последние лучи', 5, '2023-08-10');

INSERT INTO disk (id, name)
VALUES (1, 'Звуки природы'),
       (2, 'Музыка для души'),
       (3, 'Лучшие хиты 2023'),
       (4, 'Забудь о грусти'),
       (5, 'Времена года');

INSERT INTO m2m_song_disk (disk_id, song_id)
VALUES (1, 1),
       (1, 2),
       (2, 3),
       (2, 4),
       (3, 5);

INSERT INTO m2m_author_song (author_id, song_id)
VALUES (1, 1),
       (1, 2),
       (2, 3),
       (3, 4),
       (4, 5);
